jonathan-shc/UWB/ports/esp32-matter/main/lock/door_lock_manager.cpp
// BoltLockManager: Matter door lock cluster backing store for the ESP32 port. Implements the DoorLock cluster's user, credential, and weekday/yearday/holiday schedule get/set callbacks over fixed-size in-memory tables mirrored to NVM (ESP32Config blobs), plus lock/unlock actuation and PIN validation. Cluster indices are one-indexed by Matter and decremented internally before bounds-checking against this platform's fixed capacity limits.
/*
   This example code is in the Public Domain (or CC0 licensed, at your option.)
   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/
#include <door_lock_manager.h>
#include <platform/ESP32/ESP32Config.h>
#include <platform/CHIPDeviceError.h>
#include <app-common/zap-generated/attributes/Accessors.h>
#include <cstring>
#include <esp_log.h>

/* Defined in app_driver.cpp. Declared here rather than including app_priv.h,
 * whose esp_matter includes make this file's TAG ambiguous. */
void app_driver_led_lock_state(bool locked, bool aliro);

static const char *TAG = "doorlock_manager";

BoltLockManager BoltLockManager::sLock;

using namespace chip;
using namespace chip::app;
using namespace chip::app::Clusters;
using namespace chip::DeviceLayer::Internal;
using namespace ESP32DoorLock::LockInitParams;
using namespace chip::Protocols::InteractionModel;
namespace {

// Read an optional fixed-size config blob into data. Treats "config not found" as success (the blob
// is optional and data is left untouched), logs and returns false on any other read error or on a
// size mismatch between the stored value and dataLen.
bool ReadOptionalConfigBlob(ESP32Config::Key key, uint8_t *data, size_t dataLen)
{
    size_t outLen = 0;
    CHIP_ERROR err = ESP32Config::ReadConfigValueBin(key, data, dataLen, outLen);
    if (err == CHIP_DEVICE_ERROR_CONFIG_NOT_FOUND) {
        return true;
    }
    if (err != CHIP_NO_ERROR) {
        ESP_LOGW(TAG, "Failed to read door lock config blob '%s': %s", key.Name, err.AsString());
        return false;
    }
    if (outLen != dataLen) {
        ESP_LOGW(TAG, "Ignoring door lock config blob '%s' with unexpected size %u, expected %u", key.Name,
                 static_cast<unsigned>(outLen), static_cast<unsigned>(dataLen));
        return false;
    }
    return true;
}
// Write a fixed-size config blob to persistent storage. Logs and returns false on write failure.
bool WriteConfigBlob(ESP32Config::Key key, const uint8_t *data, size_t dataLen)
{
    CHIP_ERROR err = ESP32Config::WriteConfigValueBin(key, data, dataLen);
    if (err != CHIP_NO_ERROR) {
        ESP_LOGE(TAG, "Failed to write door lock config blob '%s': %s", key.Name, err.AsString());
        return false;
    }
    return true;
}

} // namespace

// Validate the configured lock parameters against this platform's fixed capacity limits
// (users, credentials per user, weekday/yearday schedules per user, holiday schedules) and store
// them. Returns CHIP_ERROR_NO_MEMORY if any configured count exceeds its platform maximum, otherwise
// CHIP_NO_ERROR. The state parameter is accepted but unused.
CHIP_ERROR BoltLockManager::Init(DataModel::Nullable<DoorLock::DlLockState> state,
                                 LockParam lockParam)
{
    LockParams = lockParam;

    if (LockParams.numberOfUsers > kMaxUsers) {
        ESP_LOGI(TAG, "Max number of users is greater than %d, the maximum amount of users currently supported on this platform", kMaxUsers);
        return CHIP_ERROR_NO_MEMORY;
    }

    if (LockParams.numberOfCredentialsPerUser > kMaxCredentialsPerUser) {
        ESP_LOGI(TAG, "Max number of credentials per user is greater than %d, the maximum amount of users currently supported on "
                 "this platform", kMaxCredentialsPerUser);
        return CHIP_ERROR_NO_MEMORY;
    }

    if (LockParams.numberOfWeekdaySchedulesPerUser > kMaxWeekdaySchedulesPerUser) {
        ESP_LOGI(TAG, " Max number of schedules is greater than %d, the maximum amount of schedules currently supported on this platform",
                 kMaxWeekdaySchedulesPerUser);
        return CHIP_ERROR_NO_MEMORY;
    }

    if (LockParams.numberOfYeardaySchedulesPerUser > kMaxYeardaySchedulesPerUser) {
        ESP_LOGI(TAG, "Max number of schedules is greater than %d, the maximum amount of schedules currently supported on this platform",
                 kMaxYeardaySchedulesPerUser);
        return CHIP_ERROR_NO_MEMORY;
    }

    if (LockParams.numberOfHolidaySchedules > kMaxHolidaySchedules) {
        ESP_LOGI(TAG, "Max number of schedules is greater than %d, the maximum amount of schedules currently supported on this platform",
                 kMaxHolidaySchedules);
        return CHIP_ERROR_NO_MEMORY;
    }

    return CHIP_NO_ERROR;
}

// Check whether userIndex is a valid user index (less than kMaxUsers).
bool BoltLockManager::IsValidUserIndex(uint16_t userIndex)
{
    return (userIndex < kMaxUsers);
}

// Check whether credentialIndex is valid for the given credential type. Programming PIN credentials
// require index 0; all other types require an index less than kMaxCredentialsPerUser.
bool BoltLockManager::IsValidCredentialIndex(uint16_t credentialIndex, CredentialTypeEnum type)
{
    if (CredentialTypeEnum::kProgrammingPIN == type) {
        return (0 == credentialIndex); // 0 is required index for Programming PIN
    }
    return (credentialIndex < kMaxCredentialsPerUser);
}

// Compute the flat storage index for a credential of the given type and per-user index, packing
// type and index into a single slot number (type * kMaxCredentialsPerUser + credentialIndex).
uint16_t BoltLockManager::CredentialStorageIndex(uint16_t credentialIndex, CredentialTypeEnum type) const
{
    return static_cast<uint16_t>(to_underlying(type) * kMaxCredentialsPerUser + credentialIndex);
}

// Check whether scheduleIndex is a valid weekday schedule index (less than
// kMaxWeekdaySchedulesPerUser).
bool BoltLockManager::IsValidWeekdayScheduleIndex(uint8_t scheduleIndex)
{
    return (scheduleIndex < kMaxWeekdaySchedulesPerUser);
}

