jonathan-shc/UWB/ports/esp32-matter/main/lock/door_lock_manager.cpp
// Check whether scheduleIndex is a valid yearday schedule index (less than
// kMaxYeardaySchedulesPerUser).
bool BoltLockManager::IsValidYeardayScheduleIndex(uint8_t scheduleIndex)
{
    return (scheduleIndex < kMaxYeardaySchedulesPerUser);
}

// Check whether scheduleIndex is a valid holiday schedule index (less than kMaxHolidaySchedules).
bool BoltLockManager::IsValidHolidayScheduleIndex(uint8_t scheduleIndex)
{
    return (scheduleIndex < kMaxHolidaySchedules);
}

// Loads all persisted door-lock state (users, credentials, names, credential data, per-user credential links, weekday/yearday/holiday schedules) from NVM into the in-memory tables.
// Detects a stale database format by checking whether credential slot 0 is occupied with a non-programming-PIN type (an old mixed-type layout); if so, clears all in-memory user and credential tables and rewrites the affected blobs to NVM.
// Returns true if all blob reads (and, if triggered, all stale-format rewrites) succeed; false if any read or rewrite fails.
bool BoltLockManager::ReadConfigValues()
{
    bool ok = true;
    ok &= ReadOptionalConfigBlob(ESP32Config::kConfigKey_LockUser, reinterpret_cast<uint8_t *>(&mLockUsers),
                                 sizeof(EmberAfPluginDoorLockUserInfo) * MATTER_ARRAY_SIZE(mLockUsers));

    ok &= ReadOptionalConfigBlob(ESP32Config::kConfigKey_Credential, reinterpret_cast<uint8_t *>(&mLockCredentials),
                                 sizeof(mLockCredentials));
    ok &= ReadOptionalConfigBlob(ESP32Config::kConfigKey_LockUserName, reinterpret_cast<uint8_t *>(mUserNames),
                                 sizeof(mUserNames));
    ok &= ReadOptionalConfigBlob(ESP32Config::kConfigKey_CredentialData, reinterpret_cast<uint8_t *>(mCredentialData),
                                 sizeof(mCredentialData));
    ok &= ReadOptionalConfigBlob(ESP32Config::kConfigKey_UserCredentials, reinterpret_cast<uint8_t *>(mCredentials),
                                 sizeof(CredentialStruct) * LockParams.numberOfUsers * LockParams.numberOfCredentialsPerUser);
    ok &= ReadOptionalConfigBlob(ESP32Config::kConfigKey_WeekDaySchedules, reinterpret_cast<uint8_t *>(mWeekdaySchedule),
                                 sizeof(EmberAfPluginDoorLockWeekDaySchedule) * LockParams.numberOfWeekdaySchedulesPerUser *
                                 LockParams.numberOfUsers);
    ok &= ReadOptionalConfigBlob(ESP32Config::kConfigKey_YearDaySchedules, reinterpret_cast<uint8_t *>(mYeardaySchedule),
                                 sizeof(EmberAfPluginDoorLockYearDaySchedule) * LockParams.numberOfYeardaySchedulesPerUser *
                                 LockParams.numberOfUsers);
    ok &= ReadOptionalConfigBlob(ESP32Config::kConfigKey_HolidaySchedules, reinterpret_cast<uint8_t *>(&(mHolidaySchedule)),
                                 sizeof(EmberAfPluginDoorLockHolidaySchedule) * LockParams.numberOfHolidaySchedules);
    if (!ok) {
        return false;
    }
    if (mLockCredentials[0].status == DlCredentialStatus::kOccupied &&
            mLockCredentials[0].credentialType != CredentialTypeEnum::kProgrammingPIN) {
        ESP_LOGW(TAG, "Clearing stale door lock database with mixed credential-type storage");
        for (auto &user : mLockUsers) {
            user = EmberAfPluginDoorLockUserInfo();
        }
        for (auto &credential : mLockCredentials) {
            credential = EmberAfPluginDoorLockCredentialInfo();
        }
        memset(mUserNames, 0, sizeof(mUserNames));
        memset(mCredentialData, 0, sizeof(mCredentialData));
        memset(mCredentials, 0, sizeof(mCredentials));
        ok &= WriteConfigBlob(ESP32Config::kConfigKey_LockUser, reinterpret_cast<const uint8_t *>(&mLockUsers),
                              sizeof(mLockUsers));
        ok &= WriteConfigBlob(ESP32Config::kConfigKey_Credential, reinterpret_cast<const uint8_t *>(&mLockCredentials),
                              sizeof(mLockCredentials));
        ok &= WriteConfigBlob(ESP32Config::kConfigKey_LockUserName, reinterpret_cast<const uint8_t *>(mUserNames),
                              sizeof(mUserNames));
        ok &= WriteConfigBlob(ESP32Config::kConfigKey_CredentialData, reinterpret_cast<const uint8_t *>(&mCredentialData),
                              sizeof(mCredentialData));
        ok &= WriteConfigBlob(ESP32Config::kConfigKey_UserCredentials, reinterpret_cast<const uint8_t *>(mCredentials),
                              sizeof(mCredentials));
    }
    return ok;
}

// Lock the bolt on the given endpoint, updating the Matter door lock cluster state and the status
// LED. Records source as the cause of the lock transition.
// userIndex: one-indexed user the operation is attributed to in the LockOperation event, or null
// when the operation cannot be traced to a stored user.
void BoltLockManager::Lock(EndpointId endpointId, OperationSourceEnum source, const DataModel::Nullable<uint16_t>  &userIndex)
{
    DoorLockServer::Instance().SetLockState(endpointId, DlLockState::kLocked, source, userIndex);
    app_driver_led_lock_state(true, false);
}

// Unlock the bolt on the given endpoint, updating the Matter door lock cluster state and the status
// LED. Drives the LED's Aliro-specific indication when source is kAliro.
// userIndex: one-indexed user the operation is attributed to in the LockOperation event, or null
// when the operation cannot be traced to a stored user.
void BoltLockManager::Unlock(EndpointId endpointId, OperationSourceEnum source, const DataModel::Nullable<uint16_t>  &userIndex)
{
    DoorLockServer::Instance().SetLockState(endpointId, DlLockState::kUnlocked, source, userIndex);
    app_driver_led_lock_state(false, source == OperationSourceEnum::kAliro);
}

// Find the user that owns a given Aliro endpoint key, so an approach unlock can be attributed to a
// person in the LockOperation event rather than reported anonymously.
// credentialData: the credential public key the reader authenticated (uncompressed P-256, 65 bytes).
// Scans occupied users' credential links for an Aliro endpoint-key credential whose stored bytes
// match, comparing against the mCredentialData backing store directly (the ByteSpan in
// mLockCredentials is restored from NVM with a stale pointer after a reboot).
// Returns the one-indexed user index, or 0 if no occupied user owns a matching credential.
uint16_t BoltLockManager::UserIndexForAliroCredential(const ByteSpan  &credentialData)
{
    for (uint16_t userIndex = 0; userIndex < kMaxUsers; userIndex++) {
        if (UserStatusEnum::kAvailable == mLockUsers[userIndex].userStatus) {
            continue;
        }
        for (uint8_t i = 0; i < kMaxCredentialsPerUser; i++) {
            const auto  &link = mCredentials[userIndex][i];
            if (link.credentialType != CredentialTypeEnum::kAliroEvictableEndpointKey &&
                    link.credentialType != CredentialTypeEnum::kAliroNonEvictableEndpointKey) {
                continue;
            }
            // Credential links carry the one-indexed cluster index; the storage index is
            // computed from the zero-based one, as in GetCredential.
            if (link.credentialIndex == 0 || !IsValidCredentialIndex(link.credentialIndex - 1, link.credentialType)) {
                continue;
            }
            uint16_t storageIndex = CredentialStorageIndex(link.credentialIndex - 1, link.credentialType);
            if (DlCredentialStatus::kOccupied != mLockCredentials[storageIndex].status) {
                continue;
            }
            if (credentialData.data_equal(ByteSpan(mCredentialData[storageIndex], kMaxCredentialSize))) {
                return static_cast<uint16_t>(userIndex + 1); // user indices are one-indexed
            }
        }
    }
    return 0;
}

