jonathan-shc/UWB/ports/esp32-matter/main/lock/door_lock_manager.cpp
    ESP_LOGI(TAG, "Lock App: BoltLockManager::GetCredential [credentialType=%u], credentialIndex=%d", to_underlying(credentialType),
             credentialIndex);
    uint16_t storageIndex = CredentialStorageIndex(credentialIndex, credentialType);
    const auto  &credentialInStorage = mLockCredentials[storageIndex];
    credential.status = credentialInStorage.status;
    ESP_LOGI(TAG, "CredentialStatus: %d, CredentialIndex: %d, StorageIndex: %d ", (int) credential.status,
             credentialIndex, storageIndex);
    if (DlCredentialStatus::kAvailable == credential.status) {
        ESP_LOGI(TAG, "Found unoccupied credential ");
        return true;
    }
    credential.credentialType = credentialInStorage.credentialType;
    credential.credentialData = credentialInStorage.credentialData;
    credential.createdBy      = credentialInStorage.createdBy;
    credential.lastModifiedBy = credentialInStorage.lastModifiedBy;
    // So far there's no way to actually create the credential outside Matter, so here we always set the creation/modification
    // source to Matter
    credential.creationSource     = DlAssetSource::kMatterIM;
    credential.modificationSource = DlAssetSource::kMatterIM;

    ESP_LOGI(TAG, "Found occupied credential [type=%u,dataSize=%u]", to_underlying(credential.credentialType),
             credential.credentialData.size());

    return true;
}

// Stores a credential by index and type for the Matter door lock cluster, persisting it to NVM.
// Programming-PIN indices are used as-is; all other credential types are one-indexed by the caller and decremented here.
// endpointId: unused, present for cluster callback signature compatibility.
// credentialIndex: caller-supplied index; must pass IsValidCredentialIndex after the type-specific decrement.
// creator, modifier: fabric indices recorded as the credential's creator and last modifier.
// credentialStatus: status to store for this credential slot.
// credentialType: type of credential being stored.
// credentialData: raw credential bytes; must not exceed kMaxCredentialSize.
// Returns true on success; false if credentialIndex is invalid, credentialData exceeds kMaxCredentialSize, or the NVM write fails.
bool BoltLockManager::SetCredential(EndpointId endpointId, uint16_t credentialIndex, FabricIndex creator,
                                    FabricIndex modifier, DlCredentialStatus credentialStatus,
                                    CredentialTypeEnum credentialType, const ByteSpan  &credentialData)
{
    if (CredentialTypeEnum::kProgrammingPIN == credentialType) {
        VerifyOrReturnValue(IsValidCredentialIndex(credentialIndex, credentialType),
                            false); // programming pin index is only index allowed to contain 0
    } else {
        VerifyOrReturnValue(IsValidCredentialIndex(--credentialIndex, credentialType), false); // otherwise, indices are one-indexed
    }

    ESP_LOGI(TAG, "Door Lock App: BoltLockManager::SetCredential "
             "[credentialStatus=%u,credentialType=%u,credentialDataSize=%u,creator=%d,modifier=%d]",
             to_underlying(credentialStatus), to_underlying(credentialType), credentialData.size(), creator, modifier);

    VerifyOrReturnValue(credentialData.size() <= kMaxCredentialSize, false);
    uint16_t storageIndex = CredentialStorageIndex(credentialIndex, credentialType);
    auto  &credentialInStorage = mLockCredentials[storageIndex];
    credentialInStorage.status         = credentialStatus;
    credentialInStorage.credentialType = credentialType;
    credentialInStorage.createdBy      = creator;
    credentialInStorage.lastModifiedBy = modifier;
    memcpy(mCredentialData[storageIndex], credentialData.data(), credentialData.size());
    credentialInStorage.credentialData = ByteSpan{ mCredentialData[storageIndex], credentialData.size() };
    // Save credential information in NVM flash
    if (!WriteConfigBlob(ESP32Config::kConfigKey_Credential, reinterpret_cast<const uint8_t *>(&mLockCredentials),
                         sizeof(mLockCredentials)) ||
            !WriteConfigBlob(ESP32Config::kConfigKey_CredentialData, reinterpret_cast<const uint8_t *>(&mCredentialData),
                             sizeof(mCredentialData))) {
        return false;
    }
    ESP_LOGI(TAG, "Successfully set the credential [credentialType=%u]", to_underlying(credentialType));

    return true;
}

// Looks up a stored weekday schedule by weekday index and user index for the Matter door lock cluster.
// weekdayIndex, userIndex: both one-indexed by the caller; decremented here and validated against their respective max counts.
// schedule: output, populated only when the slot is occupied.
// Returns DlStatus::kFailure if either index is 0 or out of range, kNotFound if the slot is unoccupied, kSuccess otherwise.
DlStatus BoltLockManager::GetWeekdaySchedule(EndpointId endpointId, uint8_t weekdayIndex, uint16_t userIndex,
                                             EmberAfPluginDoorLockWeekDaySchedule  &schedule)
{
    VerifyOrReturnValue(weekdayIndex > 0, DlStatus::kFailure); // indices are one-indexed
    VerifyOrReturnValue(userIndex > 0, DlStatus::kFailure);    // indices are one-indexed

    weekdayIndex--;
    userIndex--;

    VerifyOrReturnValue(IsValidWeekdayScheduleIndex(weekdayIndex), DlStatus::kFailure);
    VerifyOrReturnValue(IsValidUserIndex(userIndex), DlStatus::kFailure);

    const auto  &scheduleInStorage = mWeekdaySchedule[userIndex][weekdayIndex];
    if (DlScheduleStatus::kAvailable == scheduleInStorage.status) {
        return DlStatus::kNotFound;
    }

    schedule = scheduleInStorage.schedule;

    return DlStatus::kSuccess;
}

// Stores a weekday schedule by weekday index and user index for the Matter door lock cluster, persisting it to NVM.
// weekdayIndex, userIndex: both one-indexed by the caller; decremented here and validated against their respective max counts.
// status, daysMask, startHour, startMinute, endHour, endMinute: schedule fields written to the slot.
// Returns DlStatus::kFailure if either index is 0, out of range, or the NVM write fails; kSuccess otherwise.
DlStatus BoltLockManager::SetWeekdaySchedule(EndpointId endpointId, uint8_t weekdayIndex, uint16_t userIndex,
                                             DlScheduleStatus status, DaysMaskMap daysMask, uint8_t startHour, uint8_t startMinute,
                                             uint8_t endHour, uint8_t endMinute)
{
    VerifyOrReturnValue(weekdayIndex > 0, DlStatus::kFailure); // indices are one-indexed
    VerifyOrReturnValue(userIndex > 0, DlStatus::kFailure);    // indices are one-indexed

