jonathan-shc/UWB/ports/esp32-matter/main/lock/door_lock_manager.cpp
    // Save schedule information in NVM flash
    if (!WriteConfigBlob(ESP32Config::kConfigKey_HolidaySchedules, reinterpret_cast<const uint8_t *>(&(mHolidaySchedule)),
                         sizeof(EmberAfPluginDoorLockHolidaySchedule) * LockParams.numberOfHolidaySchedules)) {
        return DlStatus::kFailure;
    }
    return DlStatus::kSuccess;
}

// Return a human-readable string for a DlLockState value ("Not Fully Locked", "Locked", "Unlocked",
// "Unlatched"), or "Unknown" for kUnknownEnumValue or any unrecognized value.
const char * BoltLockManager::lockStateToString(DlLockState lockState) const
{
    switch (lockState) {
    case DlLockState::kNotFullyLocked:
        return "Not Fully Locked";
    case DlLockState::kLocked:
        return "Locked";
    case DlLockState::kUnlocked:
        return "Unlocked";
    case DlLockState::kUnlatched:
        return "Unlatched";
    case DlLockState::kUnknownEnumValue:
        break;
    }

    return "Unknown";
}

// Validates an optional PIN against the door lock's stored PIN credentials for a remote operation.
// If no PIN is supplied, succeeds unless the RequirePINforRemoteOperation attribute is true (defaults to not required if the attribute read fails). If a PIN is supplied, succeeds if it exact-matches any occupied PIN credential slot.
// endpointId: endpoint whose RequirePINforRemoteOperation attribute is checked.
// pin: PIN to validate, or empty to check whether a PIN is required.
// err: output; set to OperationErrorEnum::kInvalidCredential when a supplied PIN matches no stored credential.
// Returns true if no PIN was required or a match was found; false otherwise.
bool BoltLockManager::ValidatePIN(EndpointId endpointId, const Optional<ByteSpan>  &pin, OperationErrorEnum  &err) const
{
    // Assume pin is required until told otherwise
    bool requirePin = true;
    if (Status::Success != DoorLock::Attributes::RequirePINforRemoteOperation::Get(endpointId, &requirePin)) {
        requirePin = false;
    }

    // If a pin code is not given
    if (!pin.HasValue()) {
        ESP_LOGI(TAG, "Door Lock App: PIN code is not specified [endpointId=%d]", endpointId);

        // If a pin code is not required
        if (!requirePin) {
            return true;
        }
        ESP_LOGI(TAG, "Door Lock App: PIN code is not specified, but it is required [endpointId=%d]", endpointId);
        return false;
    }

    // Check the PIN code
    for (uint16_t credentialIndex = 0; credentialIndex < kMaxCredentialsPerUser; ++credentialIndex) {
        const uint16_t storageIndex = CredentialStorageIndex(credentialIndex, CredentialTypeEnum::kPin);
        const auto &credentialInStorage = mLockCredentials[storageIndex];
        if (credentialInStorage.status == DlCredentialStatus::kAvailable) {
            continue;
        }
        if (credentialInStorage.credentialData.data_equal(pin.Value())) {
            ESP_LOGI(TAG, "Lock App: specified PIN code was found in the database [endpointId=%d]", endpointId);
            return true;
        }
    }

    ESP_LOGI(TAG, "Door Lock App: specified PIN code was not found in the database [endpointId=%d]", endpointId);
    err = OperationErrorEnum::kInvalidCredential;
    return false;
}

// Initializes the door lock's runtime state: reads the initial lock state and per-endpoint user/credential capacity attributes (falling back to 5 credentials-per-user and 10 users on read failure), initializes BoltLockMgr with those limits, then loads persisted state from NVM.
// Returns CHIP_NO_ERROR on success; the error from BoltLockMgr().Init() if lock-parameter validation fails; CHIP_ERROR_PERSISTED_STORAGE_VALUE_NOT_FOUND if loading persisted config fails.
CHIP_ERROR BoltLockManager::InitLockState()
{
    // Initial lock state
    DataModel::Nullable<DoorLock::DlLockState> state;
    EndpointId endpointId{ 1 };
    DoorLock::Attributes::LockState::Get(endpointId, state);

    uint8_t numberOfCredentialsPerUser = 0;
    if (!DoorLockServer::Instance().GetNumberOfCredentialsSupportedPerUser(endpointId, numberOfCredentialsPerUser)) {
        ESP_LOGE(TAG, "Unable to get number of credentials supported per user when initializing lock endpoint, defaulting to 5 [endpointId=%d]", endpointId);
        numberOfCredentialsPerUser = 5;
    }

    uint16_t numberOfUsers = 0;
    if (!DoorLockServer::Instance().GetNumberOfUserSupported(endpointId, numberOfUsers)) {
        ESP_LOGE(TAG, "Unable to get number of supported users when initializing lock endpoint, defaulting to 10 [endpointId=%d]", endpointId);
        numberOfUsers = 10;
    }

    CHIP_ERROR err = BoltLockMgr().Init(state, ParamBuilder()
                                        .SetNumberOfUsers(numberOfUsers)
                                        .SetNumberOfCredentialsPerUser(numberOfCredentialsPerUser)
                                        .GetLockParam());
    if (err != CHIP_NO_ERROR) {
        ESP_LOGE(TAG, "BoltLockMgr().Init() failed");
        return err;
    }
    if (!ReadConfigValues()) {
        return CHIP_ERROR_PERSISTED_STORAGE_VALUE_NOT_FOUND;
    }
    return err;
}
